Mickyleitor/RollerShutterControlPanel/Firmware_ESP8266/lcd.h
                    _localBufferIndex++;
                    if (_localBufferIndex > (_locaBuffer.length() - 16)) {
                        _localBufferIndex = 0;
                    }
                    _locaBuffer = _locaBuffer.substring(_localBufferIndex, _localBufferIndex + 16);
                }
                lcdBuffer += _locaBuffer;
                lcdBuffer += String("<              >");
            } else if (ESP8266Utils_is_AP_created()) {
                if (((millis() - timeout_ms) > LCD_SLIDE_SPEED_MS) || _locaBuffer == "") {
                    timeout_ms   = millis();
                    _locaBuffer  = "               SSID (AP): ";
                    _locaBuffer += ESP8266Utils_get_AP_SSID();
                    _locaBuffer += String(" PWD: ");
                    _locaBuffer += ESP8266Utils_get_AP_PWD();
                    _locaBuffer += String("                ");

                    _localBufferIndex++;
                    if (_localBufferIndex > (_locaBuffer.length() - 16)) {
                        _localBufferIndex = 0;
                    }
                    _locaBuffer = _locaBuffer.substring(_localBufferIndex, _localBufferIndex + 16);
                }
                lcdBuffer += _locaBuffer;
                lcdBuffer += String("<              >");
            } else {
                lcdBuffer += String("  SSID STA & AP ");
                lcdBuffer += String("<  NOT AVAIL.  >");
            }
            break;
        }
        case SELECCION_MENU_INFO_WIFI_IP: {
            static String _locaBuffer;
            static uint8_t _localBufferIndex;
            static uint32_t timeout_ms;
            if (((millis() - timeout_ms) > LCD_SLIDE_SPEED_MS) || _locaBuffer == "") {
                timeout_ms   = millis();
                _locaBuffer  = "               IP: ";
                _locaBuffer += ESP8266Utils_get_hostname();
                _locaBuffer += String("                ");

                _localBufferIndex++;
                if (_localBufferIndex > (_locaBuffer.length() - 16)) {
                    _localBufferIndex = 0;
                }
                _locaBuffer = _locaBuffer.substring(_localBufferIndex, _localBufferIndex + 16);
            }
            lcdBuffer += _locaBuffer;
            lcdBuffer += String("<               ");
            break;
        }
    }
    sendLcdBuffer(lcdBuffer);
}
